potions = [
    {"name": "Мале зілля лікування", "price": 25, "recipes": [
        ["Календула", "Подорожник", "Мед"],
        ["Малина", "Ромашка", "Чиста джерельна вода"]
    ]},
    {"name": "Зілля лікування", "price": 50, "recipes": [
        ["Календула", "Корінь солодки", "Мед"],
        ["Камінь життєвої сили", "Кропива", "Дистильована вода"]
    ]},
    {"name": "ВЕЛИКА БЛЬОБА", "price": 100, "recipes": [
        ["Камінь життєвої сили", "Кров магічної істоти", "Календула"],
        ["Фрагмент філософського каменю", "Мед", "Кристалізована мана"]
    ]},
    {"name": "Зілля витривалості", "price": 45, "recipes": [
        ["Кропива", "Корінь лопуха", "Мед"],
        ["Ріг оленя", "Імбир", "Чиста джерельна вода"]
    ]},
    {"name": "Зілля бадьорості", "price": 20, "recipes": [
        ["Кава", "Імбир", "Цукор"],
        ["Чорний чай", "М'ята", "Мед"]
    ]},
    {"name": "Зілля міцного сну", "price": 30, "recipes": [
        ["Валеріана", "Лаванда", "Ромашка"],
        ["Меліса", "Материнка", "Молоко"]
    ]},
    {"name": "Зілля пробудження", "price": 25, "recipes": [
        ["М'ята", "Кава", "Імбир"],
        ["Розмарин", "Зелений чай", "Лимон"]
    ]},
    {"name": "Зілля нічного зору", "price": 60, "recipes": [
        ["Чорниця", "Пелюстки місячної квітки", "Пил феї"],
        ["Пір'я сови", "Аметист", "Кристал пам'яті"]
    ]},
    {"name": "Зілля гострого слуху", "price": 55, "recipes": [
        ["Пір'я сови", "Кристал пам'яті", "Меліса"]
    ]},
    {"name": "Зілля невидимості", "price": 150, "recipes": [
        ["Павутина", "Пил феї", "Пил із порталу"],
        ["Листя плюща", "Обсидіан", "Кристалізована мана"]
    ]},
    {"name": "Зілля тихого кроку", "price": 40, "recipes": [
        ["Шерсть вівці", "Павутина", "Листя плюща"]
    ]},
    {"name": "Зілля швидкості", "price": 75, "recipes": [
        ["Імбир", "Кристал грози", "Етиловий спирт"],
        ["Кігті хижого птаха", "Кристалізована мана", "Розмарин"]
    ]},
    {"name": "Зілля спритності", "price": 65, "recipes": [
        ["Кігті хижого птаха", "Розмарин", "Дистильована вода"]
    ]},
    {"name": "Зілля сили", "price": 80, "recipes": [
        ["Ріг оленя", "Корінь лопуха", "Камінь життєвої сили"],
        ["Ріг кози", "Корінь мандрагори", "Мед"]
    ]},
    {"name": "Зілля кам'яної шкіри", "price": 100, "recipes": [
        ["Кальцит", "Глина", "Панцир магічного жука"],
        ["Обсидіан", "Гіпс", "Кісткове борошно"]
    ]},
    {"name": "Зілля вогнестійкості", "price": 90, "recipes": [
        ["Луска вогняного ящера", "Застигла крапля вогню", "Гірський кришталь"]
    ]},
    {"name": "Зілля морозостійкості", "price": 85, "recipes": [
        ["Аметист", "Дощова вода", "Листя смородини"]
    ]},
    {"name": "Зілля опору блискавкам", "price": 110, "recipes": [
        ["Кристал грози", "Мідь", "Магнетит"]
    ]},
    {"name": "Зілля водного дихання", "price": 100, "recipes": [
        ["Сльоза русалки", "Риб'яча луска", "Морська сіль"],
        ["Панцир рака", "Риб'ячий жир", "Чиста джерельна вода"]
    ]},
    {"name": "Зілля очищення", "price": 40, "recipes": [
        ["М'ята", "Чиста джерельна вода", "Срібло"]
    ]},
    {"name": "Зілля протиотрути", "price": 50, "recipes": [
        ["Корінь солодки", "Подорожник", "Деревне вугілля"],
        ["Календула", "Корінь кульбаби", "Дистильована вода"]
    ]},
    {"name": "Зілля нейтралізації отрути", "price": 80, "recipes": [
        ["Отрута змії", "Календула", "Гіркий апельсин"]
    ]},
    {"name": "Зілля ясного розуму", "price": 55, "recipes": [
        ["Розмарин", "Кристал пам'яті", "Зелений чай"]
    ]},
    {"name": "Зілля пам'яті", "price": 70, "recipes": [
        ["Кристал пам'яті", "Аметист", "Мед"]
    ]},
    {"name": "Зілля правдивих слів", "price": 90, "recipes": [
        ["Аметист", "Сльоза русалки", "Винний оцет"]
    ]},
    {"name": "Зілля хоробрості", "price": 60, "recipes": [
        ["Кров магічної істоти", "Імбир", "Мед"]
    ]},
    {"name": "Зілля спокою", "price": 30, "recipes": [
        ["Меліса", "Ромашка", "Лаванда"]
    ]},
    {"name": "Зілля чарівного сну", "price": 65, "recipes": [
        ["Пелюстки маку", "Валеріана", "Пил феї"]
    ]},
    {"name": "Зілля скам'яніння", "price": 120, "recipes": [
        ["Обсидіан", "Гіпс", "Панцир рака"]
    ]},
    {"name": "Зілля кислотної крові", "price": 100, "recipes": [
        ["Оцет", "Сірка", "Отрута мантикори"]
    ]},
    {"name": "Зілля полум'я", "price": 95, "recipes": [
        ["Застигла крапля вогню", "Сірка", "Етиловий спирт"]
    ]},
    {"name": "Зілля морозного подиху", "price": 90, "recipes": [
        ["Аметист", "Дистильована вода", "Пил зачарованого кварцу"]
    ]},
    {"name": "Зілля блискавичного удару", "price": 125, "recipes": [
        ["Кристал грози", "Мідна стружка", "Кристалізована мана"]
    ]},
    {"name": "Зілля отруйного дотику", "price": 85, "recipes": [
        ["Отрута скорпіона", "Беладона", "Дьоготь"]
    ]},
    {"name": "Зілля алхімічного світла", "price": 45, "recipes": [
        ["Гірський кришталь", "Бурштин", "Кристалізована мана"]
    ]},
    {"name": "Зілля темряви", "price": 70, "recipes": [
        ["Обсидіан", "Сажа", "Пил феї"]
    ]},
    {"name": "Зілля пошуку магії", "price": 80, "recipes": [
        ["Мана-кристал", "Аметист", "Кристалізована мана"]
    ]},
    {"name": "Зілля розвіювання чар", "price": 130, "recipes": [
        ["Срібло", "Пил зачарованого кварцу", "Осколок проклятого артефакту"]
    ]},
    {"name": "Зілля телепортації", "price": 200, "recipes": [
        ["Пил із порталу", "Кристал грози", "Мана-кристал"]
    ]},
    {"name": "Зілля левітації", "price": 120, "recipes": [
        ["Пір'я сови", "Пил феї", "Гірський кришталь"]
    ]},
    {"name": "Зілля перетворення", "price": 160, "recipes": [
        ["Корінь мандрагори", "Кров магічної істоти", "Кристал пам'яті"]
    ]},
    {"name": "Зілля відновлення мани", "price": 75, "recipes": [
        ["Мана-кристал", "Мед", "Дистильована вода"]
    ]},
    {"name": "Зілля великого відновлення мани", "price": 140, "recipes": [
        ["Кристалізована мана", "Фрагмент філософського каменю", "Сльоза русалки"]
    ]},
    {"name": "Зілля зв'язку з духами", "price": 110, "recipes": [
        ["Попіл фенікса", "Пелюстки місячної квітки", "Бурштин"]
    ]},
    {"name": "Зілля бачення аури", "price": 95, "recipes": [
        ["Аметист", "Кристал пам'яті", "Пил феї"]
    ]},
    {"name": "Зілля розмови з тваринами", "price": 85, "recipes": [
        ["Пір'я ворона", "Мед", "Корінь мандрагори"]
    ]},
    {"name": "Зілля удачі", "price": 150, "recipes": [
        ["Бурштин", "Камінь життєвої сили", "Пил феї"]
    ]},
    {"name": "Зілля прокляття", "price": 180, "recipes": [
        ["Осколок проклятого артефакту", "Отрута мантикори", "Обсидіан"]
    ]},
    {"name": "Зілля мисливця", "price": 65, "recipes": [
    ["Кігті хижого птаха", "Ягоди ялівцю", "Пір'я ворона"]
    ]},
    {"name": "Філософський камінь", "price": 9999, "recipes": [
        ["Фрагмент філософського каменю", "Золото", "Кристалізована мана"]
    ]},
    {"name": "Зілля життя", "price": 99999, "recipes": [
        ["Срібло", "Корінь мандрагори", "Пелюстки місячної квітки"]
    ]}
    ]